# My Essential Tools to work with Data

In [1]:
# Columns and Row interations (add, delete, move)
# Change values and types
# Build columns with interations each other
# Overview calculation (subtotal, average, delta)
# Look up into external dataset to find correspondent values
# Pivot tables
# Plot many different charts

In [2]:
# include main libraries
import numpy as np
import pandas as pd

In [3]:
cols1 = ['product', 'cost', 'categorie']
cols2 = ['product', 'steel', 'copper', 'imported', 'not_found']

data1 = [['A',100, 'sheet metal'],
         ['B',450, 'busbar'],
         ['C',11, 'miscellaneous']]

data2 = [['A',20,0,0,None],
         ['B',0,22,0,None],
         ['C',0,0,0.33,None],
        ['C',0,0,0.33,None]]

df1 = pd.DataFrame(data1, columns=cols1)
df2 = pd.DataFrame(data2, columns=cols2)

In [4]:
df1

  product  cost      categorie
0       A   100    sheet metal
1       B   450         busbar
2       C    11  miscellaneous

In [5]:
df2

  product  steel  copper  imported not_found
0       A     20       0      0.00      None
1       B      0      22      0.00      None
2       C      0       0      0.33      None
3       C      0       0      0.33      None

In [6]:
# Columns and Row interations (add, delete, move)
# add new column into df1

df1['share'] = (df1['cost']/df1['cost'].sum())*100
df1

  product  cost      categorie      share
0       A   100    sheet metal  17.825312
1       B   450         busbar  80.213904
2       C    11  miscellaneous   1.960784

In [7]:
# add delete column 'not_found' from df2
df2 = df2.drop('not_found', axis=1)

In [8]:
# remove duplicated values into df2
df2.drop_duplicates()

  product  steel  copper  imported
0       A     20       0      0.00
1       B      0      22      0.00
2       C      0       0      0.33

In [9]:
# switch columns position on df1
df1 = df1[['product', 'categorie', 'cost', 'share']]
df1

  product      categorie  cost      share
0       A    sheet metal   100  17.825312
1       B         busbar   450  80.213904
2       C  miscellaneous    11   1.960784

In [10]:
# Change values and types
df1['cost'] = df1['cost'].astype('float')
df1.dtypes

product       object
categorie     object
cost         float64
share        float64
dtype: object

In [11]:
# Overview calculation (subtotal, average, delta)
total_cost = df1['cost'].sum()
avg_cost = df1['cost'].mean()
print('Total Cost =', total_cost)
print('Average Cost =', avg_cost)

Total Cost = 561.0
Average Cost = 187.0

In [12]:
# Look up into external dataset to find correspondent values (In process...)
df3 = pd.read_csv('data/prod_backlog.csv')

In [13]:
df3.head(5)

  product      categorie  cost
0       A    sheet metal   156
1       B         busbar   593
2       C  miscellaneous   494
3       A    sheet metal   328
4       B         busbar    87